# coding=utf-8
from webuser.models import *


question_table = {
    1: u'我做事看重细节但并不高效',
    2: u'我习惯付出多于接受',
    3: u'我习惯于做配角，默默无闻为他人服务',
    4: u'我不会给生活增添乐趣',
    5: u'我总是十分放心别人做过的事情，尽管有时不合我意',
    6: u'我喜欢说走就走的旅行',
    7: u'我很有包容力,彬彬有礼,但跟人的感情互动不深',
    8: u'我不乐意假期在公司加班',
    9: u'面对胁迫时,我焦虑的同时也有对抗危险的勇气',
    10: u'我做事有效率,也会找捷径,模仿力特强',
    11: u'我对感官的需求特别强烈,喜欢美食,服装,身体的触觉刺激,并纵情享乐',
    12: u'我的每一次表态并不一定完美',
    13: u'我不会一味迁就别人,甚至会反抗',
    14: u'我要求光明磊落,不怕与人产生矛盾与冲突',
    15: u'因为我不想给自己惹麻烦，所以别人批评我,我也不会回应和辩解',
    16: u'我做事愿意与他人合作,并非凡事都靠自己',
    17: u'这一生经历过的很多事情都充满了乐趣,人生真是快乐',
    18: u'我十分相信朋友、伴侣的忠诚',
}


def insert():
    for question_id, content in question_table.items():
        tie, result = TIEQuestion.objects.get_or_create(id=question_id)
        tie.question = content
        tie.save()

